app/views/orders/admin_history.html.erb

SELECT "orders".* FROM "orders"
---
  <tbody>
  <% Order.all.each do |order|%>

SELECT "orders".* FROM "orders"
---
      <td><%= order.first_name+" "+ order.last_name%></td>
      <td><%= order.order_date%></td>