app/views/orders/monthly_report.html.erb

  <tbody>
  <% Order.all.each do |order|%>
---
SELECT "orders".* FROM "orders"

  <div>
<h3>Total Commission: <%= Order.sum(:commission) %></h3>
---
SELECT SUM("orders"."commission") FROM "orders"