app/views/orders/show.html.erb

      <td><%= order.first_name+" "+ order.last_name%></td>
      <td><%= order.order_date%></td>
---
SELECT "orders".* FROM "orders"