app/controllers/orders_controller.rb

    def new
        @order = current_user.orders.build
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" IS NULL LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

    def create
        @order = current_user.orders.build(order_params)
        @order.delivery_status="Out for delivery"
        @order.order_date=Time.now.strftime("%F")
        if @order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" IS NULL LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "first_name", "last_name", "order_date", "value", "commission", "mobile", "address", "delivery_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def show
        @orders = Order.all
---
SELECT "orders".* FROM "orders"

    def update
        @order=Order.find(params[:id])
        @order.update(delivery_status: params[:order][:delivery_status])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "delivery_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["delivery_status", "delivered"], ["updated_at", "2022-06-10 06:48:16.715045"], ["id", 1]]

    def correct_user
        @order= current_user.orders.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]