app/controllers/sessions_controller.rb

    def create
        user = User.find_by(email: params[:login][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "meghana@gmail.com"], ["LIMIT", 1]]