app/controllers/users_controller.rb

    def create
        @user= User.new(user_params)
        @user.email.downcase!

        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)